InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ЗалоговыеБилетыЗаблокированные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ЗалоговыеБилетыЗаблокированные</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБлокировкиЗБ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыОбъектовЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтвественноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выкуплен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВостребован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изъят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтОформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наследство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключенВНакладную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъявленТорг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятНаСкладСумка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтправкеОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзНакладной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыБлокировкиЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыБлокировкиЗБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Блокировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаБлокировки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаБлокировкиЗалоговыхБилетов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокЗБПоДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина;
		Элементы.ДекорацияБлокировать.Видимость = Ложь;  
		Элементы.ДекорацияНеБлокировать.Видимость = Ложь;
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = ложь; 
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;  
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);
	Иначе
		Если Параметры.Свойство("Организация") Тогда
			Организация = Параметры.Организация; 
		Иначе
			Отказ = Истина;
		КонецЕсли;	
		ИнформацияДляПользователя();   
		ЭтаФорма.Заголовок = "Блокировка включения ЗБ в накладную на отгрузку";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокЗБПоДокументу()
	СписокЗБ.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ИнформацияДляПользователя() 
	Элементы.ДекорацияНеБлокировать.Видимость =Ложь;
	Если ТаблицаВыбора.Количество() = 0 тогда 
		Элементы.ДекорацияБлокировать.Заголовок = "Не выбраны залоговые билеты для блокировки включения в накладную"; 
	Иначе   
		Отбор = новый Структура;
		Отбор.Вставить("Вкл", Истина);
		Строки = ТаблицаВыбора.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 тогда 
		    Элементы.ДекорацияБлокировать.Заголовок = "Не выбраны залоговые билеты для блокировки включения в накладную";
		Иначе  
			СтрокаНеБлокировать = "";
			
			ТаблицаЗБ = ТаблицаВыбора.Выгрузить();
			ТаблицаЗБ.Свернуть("Вкл, ЗалоговыйБилет");   
			ОтборЗБ = Новый структура;
            ОтборЗБ.Вставить("Вкл", Истина);
            СтрокиЗБ = ТаблицаЗБ.НайтиСтроки(ОтборЗБ);
			Элементы.ДекорацияБлокировать.Заголовок = "Выбраны для блокировки включения в накладную залоговые билеты " + Строка(СтрокиЗБ.Количество());
			ОтборЗБ.Вставить("Вкл", Ложь);
            СтрокиЗБ = ТаблицаЗБ.НайтиСтроки(ОтборЗБ);
			Для каждого СтрЗБ Из СтрокиЗБ Цикл
				Отбор = Новый структура;
				Отбор.Вставить("ЗалоговыйБилет", стрЗБ.ЗалоговыйБилет);
				Строки = ТаблицаВыбора.НайтиСтроки(Отбор);
                СтрокаАртикулы = "";
				
				КолА = 0;  
				Статус = "";  
				Для каждого стр Из Строки Цикл    
					Если НЕ Стр.Вкл Тогда   
						Если Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
							 Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг тогда
						    КолА = КолА + 1;
							СтрокаАртикулы = СтрокаАртикулы + ?(ПустаяСтрока(СтрокаАртикулы), "", ", ") + СокрЛП(Стр.Артикул);
							Статус = Строка(Стр.СтатусЗалога); 
						КонецЕсли;   
					КонецЕсли;	
				КонецЦикла;	  
				
				Если НЕ КолА = 0 Тогда
					СтрокаНеБлокировать = СтрокаНеБлокировать + ?(ПустаяСтрока(СтрокаНеБлокировать), "", Символы.ПС) + "По ЗБ № " + СокрЛП(СтрЗБ.ЗалоговыйБилет.НомерЗалоговогоБилета) +
					        " предметы залога с " + ?(КолА>1, "артикулами", "артикулом") + " № " + СтрокаАртикулы + " в статусе «" + Статус + "». Блокировка включения в накладную невозможна.";
                КонецЕсли;
			КонецЦикла;	
			
			Если Не ПустаяСтрока(СтрокаНеБлокировать) Тогда
				Элементы.ДекорацияНеБлокировать.Видимость = Истина;
                Элементы.ДекорацияНЕБлокировать.Заголовок = СтрокаНеБлокировать;
			КонецЕсли;	                                                        
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	
	 
&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗБ", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЗалоговыхБилетов", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПолучитьКолИсключений(ОбъектЗалога)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной КАК ЛБ_СтатусыОбъектовЗалогаВНакладной
	               |ГДЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.ОбъектЗалога = &ОбъектЗалога
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладной.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладной.Регистратор ССЫЛКА Документ.ЛБ_КорректировкаНакладной";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРезультат.Количество();
КонецФункции


&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокЗБ", СписокЗБ);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Статус КАК Статус,
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.ДатаБлокировки КАК ДатаБлокировки
	               |ИЗ
	               |	РегистрСведений.ЛБ_ЗалоговыеБилетыЗаблокированные КАК ЛБ_ЗалоговыеБилетыЗаблокированные
	               |ГДЕ
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыБлокировкиЗБ.Блокировка)
	               |	И ЛБ_ЗалоговыеБилетыЗаблокированные.Период < &Дата
	               |	И ЛБ_ЗалоговыеБилетыЗаблокированные.ЗалоговыйБилет В(&СписокЗБ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Период УБЫВ"; 
	ТаблицаБлокировок = Запрос.Выполнить().Выгрузить();
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.Залогодатель КАК Залогодатель,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |			ПО (ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |		ПО (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет)
	               |			И (ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога)";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//ТаблицаВыбора.Очистить();     
	Для каждого Эл из СписокЗБ Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Эл.Значение);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для каждого Стр Из Строки Цикл
			НоваяСтр = ТаблицаВыбора.Добавить();
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет;
			НоваяСтр.Ломбард = Стр.ЗалоговыйБилет.Ломбард; 
			НоваяСтр.Залогодатель = Стр.Залогодатель;
			НоваяСтр.НомерЗалоговогоБилета = Стр.ЗалоговыйБилет.НомерЗалоговогоБилета;  
			НоваяСтр.СтатусЗБ = Стр.СтатусЗалоговогоБилета;    
			НоваяСтр.ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготныйСрок;
			НоваяСтр.Артикул = Стр.Артикул; 
			НоваяСтр.СтатусЗалога = Стр.СтатусОбъектаЗалога;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.КолИсключений = ПолучитьКолИсключений(Стр.ОбъектЗалога); 
			
			Если ЗначениеЗаполнено(Документ) Тогда 
				Отбор = Новый структура; 
				Отбор.Вставить("ЗалоговыйБилет", НоваяСтр.ЗалоговыйБилет); 
				
				СтрокиДок = Документ.ЗалоговыеБилеты.НайтиСтроки(Отбор);
				Если НЕ СтрокиДок.Количество() = 0 Тогда 
					СтрДок = строкиДок.Получить(0);  
					Если СтрДок.ОтменитьБлокировку Тогда
						НоваяСтр.ЕстьБлокировка = Истина;
						НоваяСтр.ОтменитьБлокировку = СтрДок.ОтменитьБлокировку;
					КонецЕсли;	
					НоваяСтр.ДатаБлокировки = СтрДок.ДатаБлокировки;
					НоваяСтр.Основание = СтрДок.ОснованиеБлокировки;
				КонецЕсли;	
			КонецЕсли;	 
		КонецЦикла;	
	Конеццикла;	 
	Если НЕ ЗначениеЗаполнено(Документ) Тогда 	
		ТаблицаЗБ = ТаблицаВыбора.Выгрузить();
		ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
		Для каждого СтрЗБ Из ТаблицаЗБ Цикл
			Отбор = Новый структура;
			Отбор.Вставить("ЗалоговыйБилет", стрЗБ.ЗалоговыйБилет);
			Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
			Недоступно = Ложь;
			Для Каждого Стр Из Строки Цикл
			    Если Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ 
					 Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг ИЛИ
					 Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Отгружен ИЛИ 
					 Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят ИЛИ
					 Стр.СтатусЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.Выкуплен Тогда
					Недоступно = Истина;
					Прервать;
				КонецЕсли;
			Конеццикла;   
			Если НЕ Недоступно Тогда 
				ДатаБлокировки = Дата(1,1,1); 
				СтрокиБ = ТаблицаБлокировок.НайтиСтроки(Отбор);
				Если НЕ СтрокиБ.Количество() = 0 Тогда 
					СтрБ = СтрокиБ.Получить(0); 
					Если СтрБ.статус = Перечисления.ЛБ_СтатусыБлокировкиЗБ.Блокировка тогда 
						Если СтрБ.ДатаБлокировки > ТекущаяДатаСеанса() Тогда
							ДатаБлокировки = СтрБ.ДатаБлокировки; 
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
				Для Каждого Стр Из Строки Цикл 
					Стр.Вкл = Истина;    
					Если НЕ ДатаБлокировки = Дата(1,1,1) Тогда
						Стр.ДатаБлокировки = ДатаБлокировки;
						Стр.ЕстьБлокировка = Истина;   
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
		КонецЦикла;    
	КонецЕсли;
КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокЗБ = Результат; 
	ЗаполнитьТаблицу();  
	ИнформацияДляПользователя();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьБлокировку(Команда)       
	СписокБлокировать = Новый СписокЗначений;  
	СписокДатыБлокировки = Новый СписокЗначений;
	СписокОснованияБлокировки = Новый СписокЗначений;   
	СписокОтменить = Новый СписокЗначений;  
	СписокОснованияОтменить = Новый СписокЗначений;

	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда 
			Если Стр.ОтменитьБлокировку Тогда 
				СписокОтменить.Добавить(Стр.ЗалоговыйБилет);
				СписокОснованияОтменить.Добавить(?(ПустаяСтрока(Стр.Основание), "без основания", Стр.Основание));
			Иначе	
				СписокБлокировать.Добавить(Стр.ЗалоговыйБилет);
				Если Стр.ДатаБлокировки = Дата(1,1,1) Тогда
					Продолжить; 
				КонецЕсли;
				СписокДатыБлокировки.Добавить(Стр.ДатаБлокировки); 
				СписокОснованияБлокировки.Добавить(?(ПустаяСтрока(Стр.Основание), "без основания", Стр.Основание));
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если СписокБлокировать.Количество() = 0 И СписокОтменить.Количество() = 0 Тогда
		Предупреждение("Не выбраны залоговые билеты для блокировки/отмены блокировки включения ЗБ в накладную", 60); 
	ИначеЕсли НЕ СписокБлокировать.Количество() = СписокДатыБлокировки.Количество() Тогда
		Предупреждение("Необходимо заполнить все даты блокировки залоговых билетов.", 60);
	Иначе  
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("СписокБлокировать", СписокБлокировать); 
		СтруктураВ.Вставить("СписокДатыБлокировки", СписокДатыБлокировки); 
		СтруктураВ.Вставить("СписокОснованияБлокировки", СписокОснованияБлокировки);
		СтруктураВ.Вставить("СписокОтменить", СписокОтменить); 
		СтруктураВ.Вставить("СписокОснованияОтменить", СписокОснованияОтменить);

		Закрыть(СтруктураВ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВкл(ЗБ, Вкл) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл  
		Стр.Вкл = Вкл;
		Если НЕ Вкл Тогда 
			Стр.ДатаБлокировки = Дата(1,1,1);  
			Стр.Основание = ""; 
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВклПриИзменении(Элемент) 
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
		ОбработатьВкл(ТекСтрока.ЗалоговыйБилет, ТекСтрока.Вкл);
		ИнформацияДляПользователя();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаВыбора.НайтиПоИдентификатору(Идентификатор);
	Возврат Стр.ЗалоговыйБилет;
КонецФункции	
	
&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
		ЗБ = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ТекСтрока.Залогодатель);
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗБ);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);  
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуБлокировки(ЗБ, ДатаБлокировки)
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл   
		Стр.ДатаБлокировки = ДатаБлокировки;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораДатаБлокировкиПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗаполнитьДатуБлокировки(ТекСтрока.ЗалоговыйБилет, ТекСтрока.ДатаБлокировки);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОснованиеБлокировки(ЗБ, Основание) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл   
		Стр.Основание = Основание;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораОснованиеПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;
	Если НЕ ТекСтрока = неопределено Тогда
	    ЗаполнитьОснованиеБлокировки(ТекСтрока.ЗалоговыйБилет, ТекСтрока.Основание);
	КонецЕсли;	
КонецПроцедуры
